In [ ]:
Pandas:
Data Analysis
Data Cleaning
Data Transformation
Data Migration
Data Handling


Data Structure in Pandas
1-D - Series
2-D - DataFrame [row * col]
n-D - Panel

In [ ]:
How to Create Dataframe:
Data Structure 
1.list of list
2.list of tuples
3.tuple of list
4.list of dict
5.dict -- values in list/tuple

Using Files:
csv file
excel file
json file 
html file

In [1]:
empdata = [[101,'keshav',53535],[102,'madhav',435353],[103,'Rakesh',534535]]

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\ai nexut it\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\ai nexut it\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ai nexut it\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\ai nexut it\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\ai nexut it\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\ai nexut it\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd

In [6]:
df = pd.DataFrame(empdata,columns=['id','name','sal'])

In [7]:
df

    id    name     sal
0  101  keshav   53535
1  102  madhav  435353
2  103  Rakesh  534535

In [ ]:
col -- colname
row -- index

In [ ]:
Database data --> tuple of tuple

In [8]:
import pymysql

In [9]:
conn = pymysql.connect(host='localhost',
                       user='root',
                       password='root',
                       port = 3306,
                       database='online78'
                      )

In [10]:
cur = conn.cursor()

In [11]:
cur.execute("select * from emp")

1003

In [12]:
data = cur.fetchall()

In [16]:
df = pd.DataFrame(data,columns=['id','name','city'])

In [17]:
df

        id             name            city
0      101           keshav        new pune
1      102            Rahul          Mumbai
2      103             Amit         Chennai
3      103             Amit            pune
4        1     Martin Silva     Lake Robert
...    ...              ...             ...
998    996  Kimberly Maddox  Elizabethburgh
999    997   Tammy Anderson      Bobbyville
1000   998  Courtney Powell     Kristinside
1001   999   Adam Gutierrez        Kevinton
1002  1000      Tina Miller  Websterborough

[1003 rows x 3 columns]

In [ ]:
DataFrame --- > Data Oper

In [ ]:
products ---> Qnty --> operation
csv data -->

In [ ]:
row by iterate --> time complexity

In [ ]:
list of list 
tuple of tuple

In [ ]:
Assignment:
list of tuple
tuple of list

In [18]:
empdata = [
{'id':101,
 'name':'Anup',
 'sal':646464,
 'city':'Pune'
},
{'id':102,
 'name':'Amit',
 'sal':646464,
 'city':'Mumabi'
},
{'id':103,
 'name':'Ramesh',
 'sal':646464,
 'city':'Chennai'
}
    
]

In [21]:
pd.DataFrame(empdata)

    id    name     sal     city
0  101    Anup  646464     Pune
1  102    Amit  646464   Mumabi
2  103  Ramesh  646464  Chennai

In [23]:
empdata = {

    'id':[1,2,3,4],
    'name':['a','b','c','d'],
    'city':['p','q','r','s']
}

In [24]:
pd.DataFrame(empdata)

   id name city
0   1    a    p
1   2    b    q
2   3    c    r
3   4    d    s

In [ ]:
#From file

In [25]:
#CSV file

In [ ]:
df = pd.read_csv(path/filename)

In [26]:
df = pd.read_csv("emprecords.csv")

In [27]:
df

    id    name       sal
0  101  keshav     54353
1  102  madhav    434342
2  103  rakesh  23432432
3  104    amit    432432

In [28]:
df = pd.read_csv("empdata100.csv")

In [29]:
df

       id    name    city       sal
0   101.0  keshav    pune   54545.0
1   102.0   rahul    pune   64646.0
2   103.0     ram     NaN       NaN
3     NaN     NaN     NaN       NaN
4     NaN     NaN     NaN       NaN
5     NaN     NaN     NaN       NaN
6   104.0  sonali  mumbai  565665.0
7   105.0  monali    pune   65656.0
8   106.0  rakesh    pune  757575.0
9   107.0     NaN     NaN       NaN
10    NaN     NaN     NaN       NaN
11    NaN     NaN     NaN       NaN
12  108.0     NaN     NaN       NaN
13  109.0   rahul    pune   64646.0

In [ ]:
real time 

csv file --- 250 records --- 200 read

In [30]:
df = pd.read_csv("emprecords.csv",names=['id','sal'])

In [31]:
df

         id       sal
id     name       sal
101  keshav     54353
102  madhav    434342
103  rakesh  23432432
104    amit    432432

In [44]:
df = pd.read_csv("employee_records.csv",names=['id','name','email','city'])

In [45]:
df

      id                name                          email               city
0    eid               ename                       eemailid               city
1      1        Tamara House            carol99@example.com          Whitestad
2      2    Patricia Stevens          hbradford@example.net      East Veronica
3      3         Victor Ryan           joseph88@example.com     Gutierrezmouth
4      4         David Glass     timothyroberts@example.org   East Kristenstad
..   ...                 ...                            ...                ...
96    96          Jill Tapia              fchen@example.org       South Vernon
97    97        Alexis Smith       timothysmith@example.net        Millerburgh
98    98         Terry Cohen  gabriellemartinez@example.com         Meghanside
99    99  Christopher Berger          heather86@example.org  West Lorrainefurt
100  100        Wendy Turner   clarkchristopher@example.net       West Jeffrey

[101 rows x 4 columns]

In [48]:
df = pd.read_csv("employee_records.csv",usecols=['eid','ename'])

In [49]:
df

    eid               ename
0     1        Tamara House
1     2    Patricia Stevens
2     3         Victor Ryan
3     4         David Glass
4     5      Lori Contreras
..  ...                 ...
95   96          Jill Tapia
96   97        Alexis Smith
97   98         Terry Cohen
98   99  Christopher Berger
99  100        Wendy Turner

[100 rows x 2 columns]

In [55]:
df = pd.read_csv("employee_records.csv",usecols=['eemailid','city'])

In [56]:
df

                         eemailid               city
0             carol99@example.com          Whitestad
1           hbradford@example.net      East Veronica
2            joseph88@example.com     Gutierrezmouth
3      timothyroberts@example.org   East Kristenstad
4             msawyer@example.com     North Luisside
..                            ...                ...
95              fchen@example.org       South Vernon
96       timothysmith@example.net        Millerburgh
97  gabriellemartinez@example.com         Meghanside
98          heather86@example.org  West Lorrainefurt
99   clarkchristopher@example.net       West Jeffrey

[100 rows x 2 columns]

In [57]:
df = pd.read_json("emp.json")

In [58]:
df

                                           Employees
0  {'userId': 'rirani', 'jobTitleName': 'Develope...
1  {'userId': 'nirani', 'jobTitleName': 'Develope...
2  {'userId': 'thanks', 'jobTitleName': 'Program ...

In [59]:
import json
with open("emp.json") as fp:
    data = json.load(fp)

In [62]:
pd.DataFrame(data['Employees'])

,userId,jobTitleName,firstName,lastName,preferredFullName,employeeCode,region,phoneNumber,emailAddress
0,rirani,Developer,Romin,Irani,Romin Irani,E1,CA,408-1234567,romin.k.irani@gmail.com
1,nirani,Developer,Neil,Irani,Neil Irani,E2,CA,408-1111111,neilrirani@gmail.com
2,thanks,Program Directory,Tom,Hanks,Tom Hanks,E3,CA,408-2222222,tomhanks@gmail.com

In [ ]:
Assigment : 
nested json -- to Pandas Dataframe

In [63]:
data = """
[
  {
    "id": 10,
    "product": "Laptop",
    "specs": {
      "cpu": "i7",
      "ram": "16GB",
      "storage": ["512GB SSD", "1TB HDD"]
    },
    "reviews": [
      {"user": "Alice", "rating": 5},
      {"user": "Bob", "rating": 4}
    ]
  },
  {
    "id": 11,
    "product": "Phone",
    "specs": {
      "cpu": "A16",
      "ram": "6GB",
      "storage": ["256GB"]
    },
    "reviews": [
      {"user": "Alice", "rating": 4},
      {"user": "David", "rating": 5}
    ]
  }
]

"""

In [64]:
data = json.loads(data)

In [67]:
df1 = pd.DataFrame(data)

In [73]:
df1['specs'][0]

{'cpu': 'i7', 'ram': '16GB', 'storage': ['512GB SSD', '1TB HDD']}

In [74]:
df1

,id,product,specs,reviews
0,10,Laptop,"{'cpu': 'i7', 'ram': '16GB', 'storage': ['512G...","[{'user': 'Alice', 'rating': 5}, {'user': 'Bob..."
1,11,Phone,"{'cpu': 'A16', 'ram': '6GB', 'storage': ['256G...","[{'user': 'Alice', 'rating': 4}, {'user': 'Dav..."

In [ ]:
API --

In [75]:
df = pd.read_json("https://api.sampleapis.com/codingresources/codingResources")

In [76]:
df

,id,description,url,types,topics,levels
0,7,Academy RPA UiPath,https://academy.uipath.com/learn/course/extern...,[interactive course],"[general programming, computer science, learn ...",[beginner]
1,8,"Also, Why I'm learning to code",http://also.roybahat.com/post/11574823708/why-...,"[reference, blog post]",[learn to code],"[beginner, intermediate, advanced]"
2,9,Alternate Java Programming Style Guide from Ja...,http://www.javaranch.com/style.jsp,[style guide],[java],"[beginner, intermediate, advanced]"
3,10,Apple Human Interface Guidelines,https://developer.apple.com/design/resources,"[article, book]",[iOS App Development],[intermediate]
4,11,Atlassian Git Tutorials,https://www.atlassian.com/git,[tutorial],[git],"[beginner, intermediate]"
...,...,...,...,...,...,...
167,174,Pritam's Book,https://www.google.com,[main course],"[general programming, computer science, learn ...",[beginner]
168,175,Pritam's Book,https://www.google.com,[interactive course],"[general programming, computer science, learn ...",[beginner]
169,177,Pritam pagol,https://www.google.com,[interactive course],"[general programming, computer science, learn ...",[beginner]
170,178,Pritam pagol,https://www.google.com,[interactive course],"[general programming, computer science, learn ...",[beginner]
171,179,Pritam's Book,https://www.google.com,[interactive course],"[general programming, computer science, learn ...",[beginner]

In [77]:
dflist = pd.read_html("COVID-19 pandemic by country and territory - Wikipedia.html")

In [83]:
dflist[15]

,Region[30],Total cases,Total deaths,Cases per million,Deaths per million,Current weekly cases,Current weekly deaths,Population millions,Vacci­nated %[31]
0,European Union,179537758,1185108,401363,2649,886074,3985,447,75.1
1,North America,103783777,1133607,281404,3074,476376,2975,369,76.1
2,Other Europe,57721948,498259,247054,2133,74354,248,234,61.2
3,South America,65835789,1313061,153151,3055,378622,1252,430,81.7
4,Russia and Central Asia,25646533,434988,108307,1837,49022,393,237,55.9
5,Central America,11338600,380660,63108,2119,60268,263,180,69.0
6,Middle East,22549784,238106,86400,912,13457,65,261,51.9
7,Oceania and islands in East Asia,60806544,318455,105317,552,1390401,2777,577,72.1
8,Caribbean,2605473,26237,60179,606,737,25,43,46.4
9,South Asia,50347136,620218,27121,334,1911,24,1856,69.4
10,North Africa,3727346,83873,18382,414,668,8,203,41.3
11,East Asia,57867768,189910,32416,106,644079,818,1785,87.2
12,Sub-Saharan Africa,8636456,172907,7598,152,6960,27,1137,27.6
13,Totals (or average),650404912,6595389,83826,850,3982929,12860,7759,67.0

In [84]:
#from excel file

In [90]:
df = pd.read_excel("empdata.xlsx",sheet_name='mumbai')

In [91]:
df

      id    name   dept  Region
0    434  keshav     IT  Mumbai
1  43423  Pratik     HR  Mumbai
2  43434  Sonali  Admin  Mumbai
3  32342    Amit     HR  Mumbai

In [ ]:
real time excel sheet region 

city --->

city -- combine -- only DF

In [99]:
from openpyxl import load_workbook

def concat_df(dflist):
    finaldf = pd.concat(dflist)
    return finaldf

def get_sheetnames(filename):
    wb = load_workbook(filename)
    return wb.sheetnames
    

def main():
    filename = 'empdata.xlsx'
    sheets = get_sheetnames(filename)
    dfl = []
    for sheet in sheets:
        dfl.append(pd.read_excel(filename,sheet_name=sheet))
    final = concat_df(dfl)
    print(final)
if __name__=='__main__':
    main()

      id    name   dept   Region
0    434  keshav     IT     Pune
1  43423  Pratik     HR     Pune
2  43434  Sonali  Admin     Pune
3  32342    Amit     HR     Pune
0    434  keshav     IT      HYD
1  43423  Pratik     HR      HYD
2  43434  Sonali  Admin      HYD
3  32342    Amit     HR      HYD
0    434  keshav     IT  Chennai
1  43423  Pratik     HR  Chennai
2  43434  Sonali  Admin  Chennai
3  32342    Amit     HR  Chennai
0    434  keshav     IT   Mumbai
1  43423  Pratik     HR   Mumbai
2  43434  Sonali  Admin   Mumbai
3  32342    Amit     HR   Mumbai
0    434  keshav     IT     test
1  43423  Pratik     HR     test
2  43434  Sonali  Admin     test
3  32342    Amit     HR     test

In [ ]:
read from excel ---

sheets --> sheet -data --